//浮点型在内存中的存储
#define _CRT_SECURE_NO_WARNINGS 1
#include <stdio.h>
#include <stdlib.h>
int main()
{
	int n = 9;
	float *pFloat = (float *)&n;
	printf("n的值为:%d\n", n);
	printf("*pFloat的值为:%f\n", *pFloat);//任意一个二进制浮点数表示为：
										 //(-1)^s*M*2^E
										 //s=0,E=00000000(8位),M=00000000000000000001001(23位)
										 //E=1-127
	                                     //M=0.00000000000000000001001
	                                     //浮点数为：0.00000000000000000001001*2^-126=1.001*2^-146约等于0.000000

	*pFloat = 9.0;
	printf("n的值为:%d\n", n);//9.0-->1001.0-->(-1)^0*1.001*2^3
	                          //s=0,E=3+127=130;M=1.001
	                          //E=130-->10000010
	                          //二进制表达为:s+E+M（有效数字M为001)为:
	                          //0 10000010 001 0000 0000 0000 0000 0000
	                         //还原为十进制为:1091567616
	printf("*pFloat的值为:%f\n", *pFloat);
	system("pause");
	return 0;
}